## OpenTofu Plan: governance

```

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place (current -> planned)
-/+ destroy and then create replacement

OpenTofu will perform the following actions:

  # azurerm_management_group.connectivity-prod is tainted, so it must be replaced
-/+ resource "azurerm_management_group" "connectivity-prod" {
      ~ display_name               = "mg-coruscant-connectivity-prod" -> (known after apply)
      ~ id                         = "/providers/Microsoft.Management/managementGroups/mg-coruscant-connectivity-prod" -> (known after apply)
        name                       = "mg-coruscant-connectivity-prod"
      # Warning: this attribute value will no longer be marked as sensitive
      # after applying this change.
      ~ subscription_ids           = (sensitive value)
      ~ tenant_scoped_id           = "/tenants/7ba436b3-340f-4c81-8cd6-2600302173a4/providers/Microsoft.Management/managementGroups/mg-coruscant-connectivity-prod" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # azurerm_management_group.corp will be created
  + resource "azurerm_management_group" "corp" {
      + display_name               = (known after apply)
      + id                         = (known after apply)
      + name                       = "mg-coruscant-corp"
      + parent_management_group_id = "/providers/Microsoft.Management/managementGroups/mg-coruscant-landingzone"
      + subscription_ids           = (known after apply)
      + tenant_scoped_id           = (known after apply)
    }

  # azurerm_management_group.identity is tainted, so it must be replaced
-/+ resource "azurerm_management_group" "identity" {
      ~ display_name               = "mg-coruscant-identity" -> (known after apply)
      ~ id                         = "/providers/Microsoft.Management/managementGroups/mg-coruscant-identity" -> (known after apply)
        name                       = "mg-coruscant-identity"
      # Warning: this attribute value will no longer be marked as sensitive
      # after applying this change.
      ~ subscription_ids           = (sensitive value)
      ~ tenant_scoped_id           = "/tenants/7ba436b3-340f-4c81-8cd6-2600302173a4/providers/Microsoft.Management/managementGroups/mg-coruscant-identity" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # azurerm_management_group.management will be updated in-place
  ~ resource "azurerm_management_group" "management" {
        id                         = "/providers/Microsoft.Management/managementGroups/mg-coruscant-management"
        name                       = "mg-coruscant-management"
      # Warning: this attribute value will no longer be marked as sensitive
      # after applying this change. The value is unchanged.
      ~ subscription_ids           = (sensitive value)
        # (3 unchanged attributes hidden)
    }

  # azurerm_management_group.online will be created
  + resource "azurerm_management_group" "online" {
      + display_name               = (known after apply)
      + id                         = (known after apply)
      + name                       = "mg-coruscant-online"
      + parent_management_group_id = "/providers/Microsoft.Management/managementGroups/mg-coruscant-landingzone"
      + subscription_ids           = (known after apply)
      + tenant_scoped_id           = (known after apply)
    }

  # azurerm_management_group.security-prod is tainted, so it must be replaced
-/+ resource "azurerm_management_group" "security-prod" {
      ~ display_name               = "mg-coruscant-security-prod" -> (known after apply)
      ~ id                         = "/providers/Microsoft.Management/managementGroups/mg-coruscant-security-prod" -> (known after apply)
        name                       = "mg-coruscant-security-prod"
      # Warning: this attribute value will no longer be marked as sensitive
      # after applying this change.
      ~ subscription_ids           = (sensitive value)
      ~ tenant_scoped_id           = "/tenants/7ba436b3-340f-4c81-8cd6-2600302173a4/providers/Microsoft.Management/managementGroups/mg-coruscant-security-prod" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # azurerm_management_group_subscription_association.connectivity_prod will be created
  + resource "azurerm_management_group_subscription_association" "connectivity_prod" {
      + id                  = (known after apply)
      + management_group_id = (known after apply)
      + subscription_id     = "/subscriptions/a51ed17e-d54a-40ef-903a-01b2ba107922"
    }

  # azurerm_management_group_subscription_association.identity will be created
  + resource "azurerm_management_group_subscription_association" "identity" {
      + id                  = (known after apply)
      + management_group_id = (known after apply)
      + subscription_id     = "/subscriptions/5209f7d6-fc0d-42a2-823e-8ade2ad7deb6"
    }

  # azurerm_management_group_subscription_association.management will be created
  + resource "azurerm_management_group_subscription_association" "management" {
      + id                  = (known after apply)
      + management_group_id = "/providers/Microsoft.Management/managementGroups/mg-coruscant-management"
      + subscription_id     = "/subscriptions/a998a203-5e24-4c8d-b2d2-536f14f7bf87"
    }

  # azurerm_management_group_subscription_association.security_prod will be created
  + resource "azurerm_management_group_subscription_association" "security_prod" {
      + id                  = (known after apply)
      + management_group_id = (known after apply)
      + subscription_id     = "/subscriptions/411a9495-ecd7-49c9-b615-b4b015fb18d8"
    }

Plan: 9 to add, 1 to change, 3 to destroy.
```
